---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData
source: html/ff847aea-8397-8b79-b039-16a72e479c9f.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData

Class holding the information needed to calculate the rebar curves.

## Syntax (C#)
```csharp
public class RebarUpdateCurvesData : IDisposable
```